## Plan Result (list-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/135445)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ListAPI-Prod:1067" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ListAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    name                   = "app"
                  ~ secrets                = [
                      + {
                          + name      = "CHARACTER_MAP"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:characterMap::"
                        },
                        {
                            name      = "DATABASE_READ_HOST"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ListAPI/Prod/READITLA_DB:read_host::"
                        },
                        # (4 unchanged elements hidden)
                        {
                            name      = "DATABASE_WRITE_USER"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ListAPI/Prod/READITLA_DB:write_username::"
                        },
                      + {
                          + name      = "LETTER_INDEX"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:letterIndex::"
                        },
                      + {
                          + name      = "MD5_RANDOMIZER"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:md5Randomizer::"
                        },
                        {
                            name      = "PARSER_DOMAIN"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/ListAPI/Prod/PARSER_DOMAIN"
                        },
                      + {
                          + name      = "POSITION_MAP"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:positionMap::"
                        },
                      + {
                          + name      = "SALT_1"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:salt1::"
                        },
                      + {
                          + name      = "SALT_2"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:salt2::"
                        },
                        {
                            name      = "SENTRY_DSN"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/ListAPI/Prod/SENTRY_DSN"
                        },
                        # (3 unchanged elements hidden)
                    ]
                    # (11 unchanged attributes hidden)
                },
                {
                    command                = [
                        "--config=/etc/ecs/ecs-xray.yaml",
                    ]
                    cpu                    = 0
                    environment            = []
                    essential              = true
                    image                  = "amazon/aws-otel-collector"
                    logConfiguration       = {
                        logDriver     = "awslogs"
                        options       = {
                            awslogs-group         = "/ecs/ListAPI-Prod/aws-otel-collector20221205232452338400000001"
                            awslogs-region        = "us-east-1"
                            awslogs-stream-prefix = "ecs"
                        }
                        secretOptions = []
                    }
                    mountPoints            = []
                    name                   = "aws-otel-collector"
                    portMappings           = [
                        {
                            containerPort = 4138
                            hostPort      = 4138
                            protocol      = "tcp"
                        },
                        {
                            containerPort = 4137
                            hostPort      = 4137
                            protocol      = "tcp"
                        },
                    ]
                    readonlyRootFilesystem = false
                    repositoryCredentials  = {
                        credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                    systemControls         = []
                    volumesFrom            = []
                },
            ] # forces replacement
        )
      ~ id                       = "ListAPI-Prod" -> (known after apply)
      ~ revision                 = 1067 -> (known after apply)
        tags                     = {
            "costCenter"  = "Pocket"
            "environment" = "Prod"
            "owner"       = "Pocket"
            "service"     = "ListAPI"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77 will be updated in-place
  ~ resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77" {
        id        = "arn:aws:iam::996905175585:policy/ListAPI-Prod-TaskExecutionRolePolicy"
        name      = "ListAPI-Prod-TaskExecutionRolePolicy"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          + "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask/*",
                          + "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask*",
                            "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/*",
                            # (6 unchanged elements hidden)
                        ]
                      - Sid      = ""
                        # (2 unchanged attributes hidden)
                    },
                  ~ {
                      - Sid      = ""
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags      = {
            "costCenter"  = "Pocket"
            "environment" = "Prod"
            "owner"       = "Pocket"
            "service"     = "ListAPI"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/ListAPI-Prod:1067" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"8c92b7ea-f164-4c34-bf3c-bbebc2248466","JobName":"list-api_infrastructure_plan_prod","PRNumber":451,"Program":"tfcmt","SHA1":"686ffe43ea6908c5adb765f84bacb207785a2d05","Target":"list-api-cdk","Vars":{}} -->